<?php

use App\Models\Customs\CustomsCode;
use App\Models\StoredItems\Item;
use Illuminate\Database\Seeder;

class ItemsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $items = [
            [
                'Автозапчасть', false, false,
                [
                    8708999909,
                    8708999909,
                    8519933900,
                    8414,
                    7322190000,
                    8516601090,
                    6307,
                    8708109000,
                    8708,
                    8539100001
                ]
            ],
            [
                'Одежда', true, false,
                [
                    6110199000,
                    6205,
                    6106909000,
                    6203199000,
                    6201990000,
                    6202990000,
                    6201990000,
                    6201990000,
                    6115109009,
                    6107,
                    6207290000,
                    6204199000,
                    6106,
                    6205,
                    6111,
                    6106,
                    6505009000,
                    6204611000
                ]
            ],
            [
                'Хозтовары', false, false,
                [
                    8201900000,
                    821520,
                    8211913000,
                    7323931000,
                    7013499900,
                    8215,
                    8201,
                    7323999900,
                    8301401900,
                    5404,
                    6216,
                    8423101000,
                    4707,
                    8536619000,
                    3808,
                    7326909800,
                    8201900009,
                    7317,
                    8467,
                    8433,
                    8202,
                    8467119000,
                    4421100000,
                    4421100000,
                    8539100001,
                    8474,
                    7214200000,
                    7318159000,
                    9503001009,
                    7308300000,
                    3918900000,
                    847431000,
                    6302399000,
                    7318,
                    8515210000,
                    8207,
                    5603141001,
                    94037,
                    9401790000,
                    8207,
                    8467,
                    902830,
                    8607,
                    9617,
                    7216509900,
                    8215209000,
                    7216100000,
                    8467,
                    9603298000
                ]
            ],
            [
                'Сантехника', false, false,
                [
                    8481803900,
                    7324,
                    7306,
                    3917219009,
                    4009,
                    7324900000,
                    7307
                ]
            ],
            [
                'Жесть', false, true,
                [
                    7212509000
                ]
            ],
            [
                'Мебель', false, false,
                [
                    9403
                ]
            ],
            [
                'Насос водяной', false, true,
                [
                    8414108000
                ]
            ],
            [
                'Игрушки', false, false,
                [
                    950300,
                    940530
                ]
            ],
            [
                'Профиль', false, false,
                [
                    7216
                ]
            ],
            [
                'Люстра', false, false,
                [
                    9405109800
                ]
            ],
            [
                'Кафель', false, true,
                [
                    6908
                ]
            ],
            [
                'Дверь', false, false,
                [
                    7308300000
                ]
            ],
            [
                'Проволка', false, true,
                [
                    7229909000
                ]
            ],
            [
                'Зонты', true, false,
                [
                    6601991900
                ]
            ],
            [
                'Ткань', true, false,
                [
                    5407940000
                ]
            ],
            [
                'Материал', true, false,
                [
                    5212241000
                ]
            ],
            [
                'Электроиды', false, true,
                [
                    8311100001
                ]
            ],
            [
                'Электронный товар', false, false,
                [
                    8536908500,
                    851640,
                    8516400000
                ]
            ],
            [
                'Сумки женские, сумки', false, false,
                [
                    4202290000
                ]
            ],
            [
                'Рубашки', false, false,
                [
                    6111900000,
                    6202990000,
                    6205909000
                ]
            ],
            [
                'Запчасть для трактора', false, false,
                [
                    8708999909
                ]
            ],
            [
                'Канцтовары', false, false,
                [
                    9405109800,
                    4820900000,
                    4820900000,
                    3506909000,
                    3703
                ]
            ],
            [
                'Обувь жен, муж, дет, тапочки', false, false,
                [
                    6402995000
                ]
            ],
            [
                'Одеяло', false, false,
                [
                    6301
                ]
            ],
            [
                'Полотенце', false, false,
                [
                    4803009000
                ]
            ],
            [
                'Простынья,пододеяльник', false, false,
                [
                    6302399000
                ]
            ],
            [
                'Раскладушка', false, false,
                [
                    9403209900
                ]
            ],
            [
                'Резиновая подошва', false, false,
                [
                    6406201000
                ]
            ],
            [
                'Стельки для обуви', false, false,
                [
                    6406109000
                ]
            ],
            [
                'Стол для тениса', false, false,
                [
                    9506409000
                ]
            ],
            [
                'Сыре(полистирол)', false, false,
                [
                    3903909900
                ]
            ],
            [
                'Сыре(полиэтилин)', false, false,
                [
                    3901909900
                ]
            ],
            [
                'Тренажер', false, false,
                [
                    9506911000
                ]
            ],
            [
                'Фуразолин', false, false,
                [
                    5211
                ]
            ],
            [
                'Цветы для украшения  ж.о', false, false,
                [
                    6702900000
                ]
            ],
            [
                'Цветы искуственные', false, false,
                [
                    907
                ]
            ],
            [
                'Кабель', false, true,
                [
                    8544429009
                ]
            ],
            [
                'Мелочовка', false, false,
                [
                    9615190000,
                    7018101900,
                    5401209000,
                    9615190000,
                    845290,
                    845230,
                    7117199900,
                    9607209000,
                    6305,
                    5604900000,
                    4421,
                    8510,
                    8214900000,
                    820320,
                    7009910000,
                    3920,
                    8470100001,
                    8470100001,
                    3701,
                    8506,
                    6306,
                    6110,
                    3919909000,
                    8513100000
                ]
            ],
            [
                'Чехлы для сидения авто', true, false,
                [
                    6307900000
                ]
            ],
        ];

        foreach ($items as $itemData) {
            $item = new Item();
            $item->name = $itemData[0];
            $item->calculateByNormAndWeight = $itemData[1];
            $item->onlyCustomPrice = $itemData[2];
            $item->applyDiscount = true;
            $item->save();

            foreach ($itemData[3] as $code) {
                $customsCode = CustomsCode::where('code', $code)->first();
                if ($customsCode)
                    $item->codes()->attach($customsCode);
            }
        }
    }
}
