<?php

use App\Models\Tariff;
use Illuminate\Database\Seeder;

class TariffsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $tariffs = [
            'Обувь-У' => 'Барои борхои Обувь',
            'Пресс-У' => 'Барои борхои ПРЕСС ва ХАЛТА (борхои птичкадорхо)',
            'Запчасти-У' => 'Барои борхои Запчасть, Хозтовар, канстовар',
            'Договорной-У' => 'Барои борхои Договоркардашуда',
            'Кашкар' => 'Борхои аз кашкар кабулкардашуда',
            'Обувь-И' => 'Барои борхои Обувь',
            'Пресс-И' => 'Барои борхои ПРЕСС ва ХАЛТА (борхои птичкадорхо)',
            'Запчасти-И' => 'Барои борхои Запчасть, Хозтовар, канстовар',
            'Дог. запчасти-У' =>  'Барои борхои хархелаи Урумчи',
            'Дог. запчасти-И' =>  'Барои борхои хархелаи ИВУ',
            'Гуанжоу Обувь' =>  'Барои борхои обувь. Кроссовки из Гуан',
            'Пресс-Гуан' =>  'Барои борхои пресс птичка. Халтадорхо',
            'Гуан-Запчасти' =>  'Барои борхои Запчасть',
            'Дог. запчасти-Гуан' =>  'Барои борхои хархелаи Гуан',
            'Кашкар-Обувь' =>  'Барои борхои хархелаи Гуан',
            'Кашар-Пресс' =>  'Барои борхо пресс, халта, птичкадорхо',
            'Кашар-Запчасти' =>  'Барои борхои Запчасть',
            'Дог. запчасти-Кашар' =>  'Барои борхои хархелаи Кашкар',
            'Договорной-К' =>  'Барои борхои Пресс, халта, птичкадорхо, договорной аз 350 кг боло',
            'Договорной-Г' =>  'Барои борхои Пресс, халта, птичкадорхо, договорной аз 350 кг боло',
            'Догоорной-ИВУ' =>  'Барои борхои Пресс, халта, птичкадорхо, договорной аз 350 кг боло'
        ];

        foreach ($tariffs as $key=>$value){
            $tariff = new Tariff();
            $tariff->name = $key;
            $tariff->description = $value;
            $tariff->save();
        }
    }
}
