<?php

use App\Models\Branch;
use App\Models\Tariff;
use Illuminate\Database\Seeder;

class TariffsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $tariffs = [
            'Обувь-У' => ['Барои борхои Обувь', Branch::where('name', 'Урумчи')->first()->id],
            'Пресс-У' => ['Барои борхои ПРЕСС ва ХАЛТА (борхои птичкадорхо)', Branch::where('name', 'Урумчи')->first()->id],
            'Запчасти-У' => ['Барои борхои Запчасть, Хозтовар, канстовар', Branch::where('name', 'Урумчи')->first()->id],
            'Договорной-У' => ['Барои борхои Договоркардашуда', Branch::where('name', 'Урумчи')->first()->id],
            'Дог. запчасти-У' =>  ['Барои борхои хархелаи Урумчи',Branch::where('name', 'Урумчи')->first()->id],

//            'Кашкар' => 'Борхои аз кашкар кабулкардашуда',

            'Обувь-И' => ['Барои борхои Обувь', Branch::where('name', 'ИВУ')->first()->id],
            'Пресс-И' => ['Барои борхои ПРЕСС ва ХАЛТА (борхои птичкадорхо)', Branch::where('name', 'ИВУ')->first()->id],
            'Запчасти-И' => ['Барои борхои Запчасть, Хозтовар, канстовар', Branch::where('name', 'ИВУ')->first()->id],
            'Дог. запчасти-И' =>  ['Барои борхои хархелаи ИВУ', Branch::where('name', 'ИВУ')->first()->id],
            'Догоорной-ИВУ' =>  ['Барои борхои Пресс, халта, птичкадорхо, договорной аз 350 кг боло', Branch::where('name', 'ИВУ')->first()->id],

//            'Гуанжоу Обувь' =>  'Барои борхои обувь. Кроссовки из Гуан',
//            'Пресс-Гуан' =>  'Барои борхои пресс птичка. Халтадорхо',
//            'Гуан-Запчасти' =>  'Барои борхои Запчасть',
//            'Дог. запчасти-Гуан' =>  'Барои борхои хархелаи Гуан',
//            'Кашкар-Обувь' =>  'Барои борхои хархелаи Гуан',
//            'Кашар-Пресс' =>  'Барои борхо пресс, халта, птичкадорхо',
//            'Кашар-Запчасти' =>  'Барои борхои Запчасть',
//            'Дог. запчасти-Кашар' =>  'Барои борхои хархелаи Кашкар',
//            'Договорной-К' =>  'Барои борхои Пресс, халта, птичкадорхо, договорной аз 350 кг боло',
//            'Договорной-Г' =>  'Барои борхои Пресс, халта, птичкадорхо, договорной аз 350 кг боло',
        ];

        foreach ($tariffs as $key=>$value){
            $tariff = new Tariff();
            $tariff->name = $key;
            $tariff->description = $value[0];
            $tariff->branch_id = $value[1];
            $tariff->save();
        }
    }
}
